knowledge-base/oa/OA_8e2d493ea9e3_发送待办.md

---
source: MinDoc
project_name: OA
source_url: https://docs.cvte.com/docs/oa/oa-1ep64r4a00rue
normalized_url: https://docs.cvte.com/docs/oa/oa-1ep64r4a00rue
url_hash: 8e2d493ea9e3
document_key: OA_8e2d493ea9e3
doc_id: oa-1ep64r4a00rue
title: 发送待办
md_hash: ad09f8d8bc91bec8
version: 1698137180
image_count: 0
crawled_at: 2026-06-11 16:01:28
---

# 发送待办

#### 接口说明


 **webservice接口**


 接口名称：发送待办
 接口地址：{域名}/sys/webservice/sysNotifyTodoWebService?wsdl
 方法: sendTodo
 入参说明


| 参数 | 描述 | 类型 | 可否为空 | 备注说明 |
| --- | --- | --- | --- | --- |
| appName | 待办来源 | 字符串(String) | 不可为空 | 标识待办来源的系统 |
| modelName | 模块名 | 字符串(String) | 不允许为空 | 标识待办来源的模块 |
| modelId | 待办唯一标识 | 字符串(String) | 不允许为空 | 标识待办在原系统唯一标识 |
| subject | 标题 | 字符串(String) | 不允许为空 | 待办标题 |
| link | 链接 | 字符串(String) | 不允许为空 | 对应待办的链接地址(全路径) |
| mobileLink | 移动端链接 | 字符串(String) | 允许为空 | 对应待办的链接地址(全路径) |
| type | 待办类型 | 数字(int) | 不允许为空 | 1:表示审批类待办 2:表示为通知类待办 |
| targets | 待办所属对象 | 字符串(JSON) | 不允许为空 | 待办对应接收人，数据格式为JSON |
| createTime | 创建时间 | 字符串(String) | 不允许为空 | 格式为:yyyy-MM-dd HH:mm:ss |
| docCreator | 待办创建者 | 字符串(JSON) | 可为空 | 待办的创建者。数据格式为JSON |
| level | 待办优先级 | 数字(int) | 可为空 | 待办优先级。如：按紧急（1）、急（2）、一般（3）。 |
| param1 | 通知渠道 | 字符串 | 可为空 | 通知渠道。如：”wx”:企微,”email”:邮件,”wx,email”:企微和邮件 |


示例:


```
<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:ns0="http://webservice.notify.sys.kmss.landray.com/" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://sys.webservice.client" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header>
      <RequestSOAPHeader/>
      <tns:user>ekptodo</tns:user>
      <tns:password>密码线下提供</tns:password>
   </SOAP-ENV:Header>
   <ns1:Body>
      <ns0:sendTodo>
         <arg0>
            <appName>TESTAPPNAME</appName>
            <createTime>2022-01-10 11:18:26</createTime>
            <docCreator>{"LoginName": "XXX"}</docCreator>
            <level>3</level>
            <link>https://xxxx.cvte.com/rr/my_ap/3s/INC-151522</link>
            <modelId>TEST221111</modelId>
            <modelName>TESTMODELNAME</modelName>
            <subject>【测试】待办测试</subject>
            <targets>[{"LoginName": "XXX"}]</targets>
            <type>1</type>
            <param1>wx,email</param1>
         </arg0>
      </ns0:sendTodo>
   </ns1:Body>
</SOAP-ENV:Envelope>
```


返回信息


| 参数 | 描述 | 类型 | 可否为空 | 备注说明 |
| --- | --- | --- | --- | --- |
| returnState | 返回状态 | 数字(int) | 不可为空 | 0:表示未操作 1:表示操作失败 2:表示操作成功 |
| message | 返回信息 | 字符串(String) | 可为空 | 错误信息 |


示例：


```
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns1:sendTodoResponse xmlns:ns1="http://webservice.notify.sys.kmss.landray.com/">
         <return>
            <returnState>2</returnState>
         </return>
      </ns1:sendTodoResponse>
   </soap:Body>
</soap:Envelope>
```
