knowledge-base/oa/OA_76736b51ff92_设为已办.md

---
source: MinDoc
project_name: OA
source_url: https://docs.cvte.com/docs/oa/oa-1ep650j12rhkr
normalized_url: https://docs.cvte.com/docs/oa/oa-1ep650j12rhkr
url_hash: 76736b51ff92
document_key: OA_76736b51ff92
doc_id: oa-1ep650j12rhkr
title: 设为已办
md_hash: b36612aef7a5dce6
version: 1685690764
image_count: 0
crawled_at: 2026-06-11 16:01:29
---

# 设为已办

#### 接口说明


**webservice接口**


 接口名称：置为已办
 接口地址：{域名}/sys/webservice/sysNotifyTodoWebService?wsdl
 方法: sendTodoDone
 入参说明


| 参数 | 描述 | 类型 | 可否为空 | 备注说明 |
| --- | --- | --- | --- | --- |
| appName | 待办来源 | 字符串(String) | 不可为空 | 标识待办来源的系统 |
| modelName | 模块名 | 字符串(String) | 不允许为空 | 标识待办来源的模块 |
| modelId | 待办唯一标识 | 字符串(String) | 不允许为空 | 标识待办在原系统唯一标识 |
| optType | 操作类型 | 数字(int) | 不允许为空 | 1:表示设待办为已办操作 2:表示设置目标待办所属人为已办操作 |
| type | 待办类型 | 数字(int) | 可为空 | 待办类型，1 待审 2 待阅 3暂挂 |
| targets | 待办所属对象 | 字符串(JSON) | 当操作类型为2时,生效,且不能为空 | 待办所属人 |


示例:


```
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.notify.sys.kmss.landray.com/">
     <soapenv:Header>
      <tns:RequestSOAPHeader xmlns:tns="http://sys.webservice.client">
      <tns:user>ekptodo</tns:user>
      <tns:password>联系提供</tns:password>
      </tns:RequestSOAPHeader>
    </soapenv:Header>
   <soapenv:Body>
      <web:setTodoDone>
         <arg0>
            <appName>TESTAPPNAME</appName>
            <modelId>TESTAPPNAME_221111</modelId>
            <modelName>TESTMODELNAME</modelName>
            <optType>1</optType>
            <targets>{"LoginName":"XXX"}</targets>
            <type>1</type>
         </arg0>
      </web:setTodoDone>
   </soapenv:Body>
</soapenv:Envelope>
```


返回信息


| 参数 | 描述 | 类型 | 可否为空 | 备注说明 |
| --- | --- | --- | --- | --- |
| returnState | 返回状态 | 数字(int) | 不可为空 | 0:表示未操作 1:表示操作失败 2:表示操作成功 |
| message | 返回信息 | 字符串(String) | 可为空 | 错误信息 |


示例：


```
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns1:setTodoDoneResponse xmlns:ns1="http://webservice.notify.sys.kmss.landray.com/">
         <return>
            <returnState>2</returnState>
         </return>
      </ns1:setTodoDoneResponse>
   </soap:Body>
</soap:Envelope>
```
